CLB `keep_image_login`

issue: forceNew when updating terraform version



```
 make testacc TESTARGS=" -run=TestAccTencentCloudInstanceWithImageLogin"
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./... -v -run=TestAccTencentCloudInstanceWithImageLogin -timeout 120m
?       github.com/tencentcloudstack/terraform-provider-tencentcloud    [no test files]
testing: warning: no tests to run
PASS
ok      github.com/tencentcloudstack/terraform-provider-tencentcloud/gendoc    (cached) [no tests to run]
=== RUN   TestAccTencentCloudInstanceWithImageLogin
=== PAUSE TestAccTencentCloudInstanceWithImageLogin
=== CONT  TestAccTencentCloudInstanceWithImageLogin
--- PASS: TestAccTencentCloudInstanceWithImageLogin (66.36s)
PASS
ok      github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud       67.745s
?       github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/connectivity  [no test files]
?       github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/internal/helper       [no test files]
?       github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/ratelimit     [no test files]

```


creating apply
deleted tfstate `keep_image_login` then login

```
terraform apply
2020/10/20 19:49:31 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_instance_types.default: Refreshing state...
data.tencentcloud_availability_zones.default: Refreshing state...
data.tencentcloud_images.zoo: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.foo will be created
  + resource "tencentcloud_instance" "foo" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-guangzhou-3"
      + create_time                             = (known after apply)
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-gpvqhyj0"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "test-keepimage"
      + instance_status                         = (known after apply)
      + instance_type                           = "S1.SMALL1"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 1
      + key_name                                = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id          = (known after apply)
          + data_disk_size        = (known after apply)
          + data_disk_snapshot_id = (known after apply)
          + data_disk_type        = (known after apply)
          + delete_with_instance  = (known after apply)
          + encrypt               = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_instance.foo: Creating...
tencentcloud_instance.foo: Still creating... [10s elapsed]
tencentcloud_instance.foo: Still creating... [20s elapsed]
tencentcloud_instance.foo: Creation complete after 20s [id=ins-5afho7my]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

gailwang@gailwang-PC2 MINGW64 /e/gailwang_terrraform (master)
$ terraform apply
2020/10/20 19:53:50 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_availability_zones.default: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
data.tencentcloud_images.zoo: Refreshing state...
tencentcloud_instance.foo: Refreshing state... [id=ins-5afho7my]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```

added `keep_image_login` false

```
terraform apply
2020/10/20 19:54:35 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_images.zoo: Refreshing state...
data.tencentcloud_availability_zones.default: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
tencentcloud_instance.foo: Refreshing state... [id=ins-5afho7my]

```


updated ` keep_image_login` true

```
 terraform apply
2020/10/20 19:56:24 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_availability_zones.default: Refreshing state...
data.tencentcloud_images.zoo: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
tencentcloud_instance.foo: Refreshing state... [id=ins-5afho7my]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tencentcloud_instance.foo must be replaced
-/+ resource "tencentcloud_instance" "foo" {
        allocate_public_ip                      = false
        availability_zone                       = "ap-guangzhou-3"
      ~ create_time                             = "2020-10-20T11:49:48Z" -> (known after apply)
        disable_monitor_service                 = false
        disable_security_service                = false
      + expired_time                            = (known after apply)
        force_delete                            = false
      ~ id                                      = "ins-5afho7my" -> (known after apply)
        image_id                                = "img-gpvqhyj0"
        instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
        instance_name                           = "test-keepimage"
      ~ instance_status                         = "RUNNING" -> (known after apply)
        instance_type                           = "S1.SMALL1"
      ~ internet_charge_type                    = "TRAFFIC_POSTPAID_BY_HOUR" -> (known after apply)
        internet_max_bandwidth_out              = 1
      + keep_image_login                        = true # forces replacement
      + key_name                                = (known after apply)
      ~ private_ip                              = "10.104.1.87" -> (known after apply)
        project_id                              = 0
      + public_ip                               = (known after apply)
        running_flag                            = true
      ~ security_groups                         = [
          - "sg-nltpbqg1",
        ] -> (known after apply)
      + subnet_id                               = (known after apply)
      ~ system_disk_id                          = "disk-m8uh6yj0" -> (known after apply)
        system_disk_size                        = 50
        system_disk_type                        = "CLOUD_PREMIUM"
      - tags                                    = {} -> null
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id          = (known after apply)
          + data_disk_size        = (known after apply)
          + data_disk_snapshot_id = (known after apply)
          + data_disk_type        = (known after apply)
          + delete_with_instance  = (known after apply)
          + encrypt               = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```